{"pages":[],"posts":[{"title":"My first post ... @Dariel :)","text":"Week 0ne @ Dariel (08/10/2018 to 12/10/2018) Day 1 complete discovery group life documents get final take on which client to settle on CIB or BRMS? save notes to bitbucket - teamdarielconsultant — Bitbucket Day 2 Engaging with co-workers Lunch for new starters Reading up on OpenShift (TechStack @ Absa CiB -&gt; Docker / Kubernetes / SpringBoot) Day 3 Reading up on OpenShift (TechStack @ Absa CiB -&gt; Docker / Kubernetes / SpringBoot) ~~setup docker on windows (abandoned - to many dependencies like Hyper-V etc) create a virtualbox image for ubuntu Day 4 Research on OAuth + API versioning (TechStack @ Absa CiB -&gt; Docker / Kubernetes / SpringBoot) hr documents / forms / etc with Busi Meeting with Lucy Ferriera - Absa (SDS and Midbase Service Development for C1V) ---Notes--- 1. create CIB specific api&apos;s 2. use oauth as authentication pattern - for alignment with CIB 3. should provide feeedback on regular basis 4. Raise risks &amp; dependencies. 5. make sure right thing is built - ask questions asap 6. provide technical recommendation in terms of architecture and design 7. people: 7.1 Lucy Ferriera, projects person based in Sandton 7.2 Karen Bonthuys, (Head of systems that will consume api&apos;s) based in Sandton 7.3 Gerhard Maree, () based in CBD Absa Towers 8. Scalability of solution - Hadoop to be used for data solution 9. api version strategies 10. MongoDB datastore ------------ Day 5 Research on OAuth (TechStack @ Absa CiB -&gt; Docker / Kubernetes / SpringBoot / OpenShift) complete timesheets To Do ArticlesCheat Sheet | Markdown Guide TechStack for ABSAInstalling Spring Boot with Maven and GradleMicroservices Tutorials — Best of September 2018 - DZone MicroservicesVersioning a REST API | BaeldungWhat’s the Best Strategy for Versioning a RESTful API?API Versioning Has No “Right Way” – APIs You Won’t HateAPI design: Which version of versioning is right for you? | Google Cloud BlogOAuth 2 Simplified • Aaron PareckiTutorial · Spring Boot and OAuth2 GuidesTutorial · Spring Security and Angular DevOpsHow To Become a DevOps Engineer In Six Months or LessThe 2018 DevOps RoadMap – Hacker Noon ML/AI‘I want to learn Artificial Intelligence and Machine Learning. Where can I start?’ CS Skills50+ Data Structure and Algorithms Interview Questions for Programmers Brain Dump setup application template for java based web project consider creating a templates folder for reusable pages, etc. Git commands to resolve git push issue: ` git config --global core.compression 1` git@bitbucket.org:teamdarielconsultant/dariel-repo.git git remote set-url origin ssh_url(git@bitbucket.org:repo.git) Tip of the WeekProblem : Window opens in non existent secondary screen, to bring back to the current screen, use `&lt;ALT&gt;&lt;SPACE&gt;, then select &lt;MAXIMISE&gt; `","link":"/2018/10/24/My-first-post/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2018/10/24/hello-world/"}],"tags":[],"categories":[]}